<template>
  <div>
    <h1>Парадокс Монти Холла</h1>
    <p v-if="doorSwaped">Вы сделали правильно, что поменяли дверь.</p>
    <div v-else>
      <p>Вы решили не менять дверь и совершили математическую ошибку.</p>
      <p>
        Вы, наверное, думаете, почему, какая разница поменяю я дверь или нет, всё равно шансы 50 на
        50. И вот тут и кроется главная ошибка! <b>Шансы не 50 на 50</b>!
      </p>
    </div>
    <p>
      Вы не знаете, за какой дверью спрятано авто, но, важный момент, <b>я знаю</b>! И если при
      первом выборе шансы у каждой двери были 33%, то во второй раз, вы выбирали не 50 на 50, а ваша
      дверь, как и раньше, 33%, а моя 66%.
    </p>
    <p>
      Если Вы в первый раз выбрали дверь с авто (Вам повезло и сыграли Ваши 33%), то мне без
      разницы, какую дверь Вам открывать, за обоими козы. Но если Вы промазали при первой попытке, я
      Вам, естественно, открою ту дверь, за которой нет автомобиля. Значит, та дверь, которую Вы
      выбрали в первый раз, как имела шанс 33%, так и осталась. А 33% двери, которую я открыл,
      "перетекли" двери, которую я оставил.
    </p>
    <p>
      Понятно? Если всё еще нет, попробуйте поиграть еще пару раз, увеличьте количество дверей для
      наглядности или почитайте про этот парадокс в
      <a
        href="https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D1%80%D0%B0%D0%B4%D0%BE%D0%BA%D1%81_%D0%9C%D0%BE%D0%BD%D1%82%D0%B8_%D0%A5%D0%BE%D0%BB%D0%BB%D0%B0"
        target="_blank"
        rel="noopener noreferrer"
        >Википедии</a
      >
    </p>
    <p>
      (<em>Менять количество дверей и перезапускать игру можно в настройках в верхнем левом углу</em
      >)
    </p>
    <p>
      Можете нажать продолжить и посмотреть свой результат, выиграли Вы в этот раз или нет.
    </p>
    <p v-if="doorSwaped">
      Вы правы с математической точки зрения, но все еще есть шанс 33%, что Вы были правы
      изначально, и проиграли, поменяв дверь.
    </p>
    <p v-else>
      Может, несмотря на то, что Вы ошиблись математически, все-таки сыграли Ваши 33% и Вы выиграли.
    </p>
    <p>
      Это не имеет значения. По крайней мере, в долгосрочной перспективе.
    </p>
    <div @click="round2">
      <Button>Посмотреть результат</Button>
    </div>
  </div>
</template>

<script>
import { mapGetters, mapMutations } from 'vuex'
import Button from '../../assets/Button.vue'

export default {
  components: { Button },
  computed: {
    ...mapGetters(['doorSwaped'])
  },
  methods: {
    ...mapMutations(['round2'])
  }
}
</script>

<style></style>
